Revit 2027 API
MEPModel.ConnectorManager Property
 Retrieves the Connector Manager from this MEPModel.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ConnectorManager ConnectorManager { get; }
Public ReadOnly Property ConnectorManager As ConnectorManager
	Get
public:
property ConnectorManager^ ConnectorManager {
	ConnectorManager^ get ();
}
member ConnectorManager : ConnectorManager with get
Property Value
ConnectorManager
See Also
Reference
MEPModel Class
Autodesk.Revit.DB Namespace